public class Main {

    public static void main(String[] args) {
        System.out.println("Hello World!");
        int Translate;  //定义变迁数量
        int Postation;  //定义位置数量
        int[][] L1 = {
                { 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0 },
                { 0, 0, 0, 1, 1, 1, 1, 1, 1, 1, 1, 0, 0, 0, 0 },
                { 0, 0, 1, 1, 0, 0, 0, 0, 0, 0, 1, 1, 1, 0, 0 },
                { 0, 0, 0, 1, 0, 0, 0, 0, 0, 1, 1, 0, 0, 0, 0 },
                { 0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 0, 0, 0, 0, 0 },
                { 0, 0, 0, 1, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0 },
                { 0, 0, 0, 1, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0 }};
        //定义伴随矩阵L1(ij),如果变迁J到位置I有连接，则L1(ij) = 1;
        int[][] L2 = {
                { 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0 },
                { 0, 0, 0, 1, 1, 1, 1, 1, 1, 1, 1, 0, 0, 0, 0 },
                { 0, 0, 1, 1, 0, 0, 0, 0, 0, 0, 1, 1, 1, 0, 0 },
                { 0, 0, 0, 1, 0, 0, 0, 0, 0, 1, 1, 0, 0, 0, 0 },
                { 0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 0, 0, 0, 0, 0 },
                { 0, 0, 0, 1, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0 },
                { 0, 0, 0, 1, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0 }};
        //定义伴随矩阵L2(ij),如果位置i到变迁J有连接，则L1(ij) = 1;
        int[] startValue = {0, 0, 0, 0, 0, 0, 0, 0, 0};      //设定初始值
        State START = new State(startValue);
        int[] endtValue = {0, 0, 0, 0, 0, 0, 0, 0, 0};      //设定目标值
        State END = new State(endtValue);
        Kernel kernel = new Kernel(START,END, L1, L2);//带入参数和地图
        kernel.start();                       //开始执行

    }
}
